README.org
#+TITLE:  EMACS: Anatomy of a personal configuration
#+DATE: [2022-12-26 Mon]
#+last_modified: 2025-07-06 21:17:57
#+AUTHOR: Rhyloo
#+description: Rhyloo Solutions is a personal blog from Jorge Benavides Macias where I write about tech. My main interests are electronics.
#+STARTUP: hideblocks
#+OPTIONS: broken-links:t htmlize-source:t ^:nil num:nil toc:1
#+PROPERTY: header-args :results silent :tangle yes
#+cover_image: ./../projects/files/cover/EmacsIcon.png

* Introduction
** Why EMACS?
No sé como empecé con EMACS, recuerdo que con aproximadamente 13 años empecé en linux. Visualicé muchos videos de diferentes distros, incluso borré varias veces mi SO - Desde aquí envío un saludo a mis padres por no "matarme" - En cualquier caso, supongo que el ecosistema Linux me llevó a investigar más sobre el tema. Las conferencias de RMS sobe el proyecto GNU y porqué no la página de la propia FSF me llevaron a este maravilloso editor.

He probado muchos, atom, VScode, notepad++, bloc de notas, sublime e incluso vi/vim, pero me seguiría quedando con este. Me adapto en el trabajo he tenido que utilizar vscode y no hay ningún problema, no voy tan fluido como cuando trabajo en mi entorno, pero lo hago sin problemas. Ahora bien siempre que puedo vuelvo a él porque por alguna razón yo lo encuentro fascinante, no tanto por lo que ofrece ya que hay gente que incluso ha jugado al doom en él, supera eso VIM. Creo que es la personalización, creo que esa es la mejor parte. Me atrevería a decir que me llena por dentro construirme mis propias herramientas desde cero - menos mal que no he bajado a nivel de bit, transistor u átomo ;) - bromas aparte, sí creo que es parte de la naturaleza ingenieril y EMACS te da esa posibilidad.

Hoy en día, con la IA, tenemos muchos problemas para escribir código. El cerebro se acostumbra muy rápido a lo fácil. Intentaré en la medida de lo posible no utilizarlo, esto no lo hago por tener un proyecto más, lo hago porque me gusta, así que si la utilizo al menos indicaré que no es mi obra con algún tag o etiqueta. 

** Information
- Name: Personal EMACS Configuration
- Versión: v0.1.0
- Project-ID: SW-ELISP-0.1.0-JESTER
- Status: IN-PROGRESS
  
* Startup optimization
Este bloque de configuración optimiza el proceso de inicio de Emacs y proporciona información útil sobre el rendimiento.
** Perfil del tiempo de inicio
Muestra un mensaje en el minibuffer indicando cuánto tiempo tomó iniciar Emacs y cuántas recolecciones de basura ocurrieron durante el proceso.
#+begin_src emacs-lisp
(add-hook 'emacs-startup-hook
	        (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
	                   (format "%.2f seconds" (float-time (time-subtract after-init-time before-init-time))) gcs-done)))
#+end_src
** Minimizar la recolección de basura durante el inicio
Al aumentar el umbral de recolección de basura al valor máximo, se reduce la frecuencia de las recolecciones, acelerando así el proceso de inicialización.
#+begin_src emacs-lisp
(setq gc-cons-threshold (* 50 1000 1000)) ;; Minimize garbage collection during startup
#+end_src
* Core
** Data
#+begin_src emacs-lisp
(setq user-full-name "Rhyloo"  ;; Set my name
      user-mail-address "me@rhyloo.com"
      user-real-login-name "Rhyloo")    ;; Set my user
#+end_src
** UI
*** Visual
**** General configurations
#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)                           ;; Replace yes or no for y or n
(setq inhibit-startup-message t)                        ;; Avoid startup message
(setq frame-title-format '("%b [%m]"))                  ;; Title bar name
(when (display-graphic-p) 
  (scroll-bar-mode -1)                                  ;; Disable visible scrollbar
  (tool-bar-mode -1)                                    ;; Disable the toolbar
  (tooltip-mode -1)                                     ;; Disable tooltips
  (set-fringe-mode 3)                                   ;; Give some breathing room (borders)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))
(menu-bar-mode -1)                                      ;; Disable the menu bar terminal and display mode
#+end_src
**** Mode line
To config time display
#+begin_src emacs-lisp
(setq display-time-format "%H:%M %d %b %y" display-time-default-load-average nil) ;; Show hour minute day month and year
(setq display-time-day-and-date t display-time-24hr-format t) ;; Change format to 24h
(display-time)               ;; Show the time in the bar
#+end_src
To config battery display
#+begin_src emacs-lisp
(unless (equal "Battery status not available" (battery)) ;;Show battery
  (display-battery-mode 1))    ; On laptops it's nice to know how much power you have
#+end_src
To add words and characters to modeline
#+begin_src emacs-lisp
(setq-default mode-line-format
              (append mode-line-format
                      (list
                       '(:eval (if (use-region-p)
                                   (format "W:%d, C:%d"
                                           (count-words-region (region-beginning) (region-end))
                                           (- (region-end) (region-beginning)))
                                 "")))))
(column-number-mode)                                    ;; Show collumn in modeline
#+end_src
*** Behavior
**** Init
#+begin_src emacs-lisp
(bookmark-bmenu-list)
(switch-to-buffer "*Bookmark List*")
(setq auth-sources '("~/.authinfo" "~/.authinfo.gpg" "~/.netrc" "~/.emacs.d/.authinfo")) ;; Check this later
#+end_src
**** Screen
#+begin_src emacs-lisp
(setq ring-bell-function 'ignore)                       ;; Remove bell ring
(if (display-graphic-p)                                 ;; Highlight lines
    (global-hl-line-mode 1)      
  (global-hl-line-mode 0))
#+end_src
**** Mouse/Scroll
#+begin_src emacs-lisp
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))     ;; one line at a time
(setq mouse-wheel-progressive-speed nil)                ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't)                      ;; scroll window under mouse
(setq scroll-step 1)                                    ;; keyboard scroll one line at a time
#+end_src
**** Writting
#+begin_src emacs-lisp
(show-paren-mode 1)                                     ;; Show parens
(global-visual-line-mode 1)  ;; Better than fix the lines with set-fill-column
(delete-selection-mode 1) ;; Let you select and replace with yank or write
(add-hook 'prog-mode-hook #'subword-mode) 
(add-hook 'org-mode-hook #'subword-mode)
#+end_src
**** Dired
#+begin_src emacs-lisp
(put 'dired-find-alternate-file 'disabled nil)
#+end_src
* Packages
** Configuration
Configuración de repositorios para ELPA, MELPA y soporte adicional para Org mode.  
Se utiliza =use-package= para simplificar la configuración de paquetes.
#+begin_src emacs-lisp
(setq package-archives                                           ;; Init package repositories.
      '(("gnu"          . "https://elpa.gnu.org/packages/")      ;; Set GNU repository
        ("melpa"        . "https://melpa.org/packages/")))       ;; Set Melpa repository
(unless package-archive-contents (package-refresh-contents))     ;; Are package archives up to date?
(unless (package-installed-p 'use-package)                       ;; Is 'use-package' installed?
  (package-install 'use-package)
  (setq use-package-always-ensure t)) 
#+end_src
** EMACS
#+begin_src emacs-lisp
;; Configuración optimizada de números de línea
(use-package emacs
  :init
  ;; ---------------------------
  ;; 1. Habilitar en modos padres (evita redundancia)
  ;; ---------------------------
  ;; text-mode-hook ya cubre org-mode, markdown-mode, etc.
  ;; prog-mode-hook cubre todos los lenguajes de programación
  (defun my/enable-line-numbers ()
    "Activar números de línea solo en GUI y modos específicos."
    (when (display-graphic-p)
    (display-line-numbers-mode 1)))

  ;; Añadir solo a los hooks principales
  (dolist (hook '(text-mode-hook prog-mode-hook conf-mode-hook))
    (add-hook hook #'my/enable-line-numbers :append))

  ;; ---------------------------
  ;; 2. Deshabilitar en modos específicos (más eficiente)
  ;; ---------------------------
  (defun my/disable-line-numbers ()
    "Desactivar números de línea donde no se necesitan."
    (display-line-numbers-mode -1))

  ;; Org Mode (sobrescribe text-mode-hook)
  (add-hook 'org-mode-hook #'my/disable-line-numbers :append))
#+end_src
** Vscode Dark Theme
#+begin_src emacs-lisp
(when (display-graphic-p)
  (use-package vscode-dark-plus-theme
    :ensure t
    :defer t
    :init
    (add-hook 'after-init-hook (load-theme 'vscode-dark-plus t))))
#+end_src
** Org-mode
*** Visual
#+begin_src emacs-lisp
(setq org-startup-folded t)
(setq org-return-follows-link 1)
(setq org-src-tab-acts-natively t)    ;; Indent code in org-babel
#+end_src
*** Configurations
