README.el
(add-hook 'emacs-startup-hook
	        (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
	                   (format "%.2f seconds" (float-time (time-subtract after-init-time before-init-time))) gcs-done)))

(setq gc-cons-threshold (* 50 1000 1000)) ;; Minimize garbage collection during startup

(setq user-full-name "Rhyloo"  ;; Set my name
      user-mail-address "me@rhyloo.com"
      user-real-login-name "Rhyloo")    ;; Set my user

(fset 'yes-or-no-p 'y-or-n-p)                           ;; Replace yes or no for y or n
(setq inhibit-startup-message t)                        ;; Avoid startup message
(setq frame-title-format '("%b [%m]"))                  ;; Title bar name
(when (display-graphic-p) 
  (scroll-bar-mode -1)                                  ;; Disable visible scrollbar
  (tool-bar-mode -1)                                    ;; Disable the toolbar
  (tooltip-mode -1)                                     ;; Disable tooltips
  (set-fringe-mode 3)                                   ;; Give some breathing room (borders)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))
(menu-bar-mode -1)                                      ;; Disable the menu bar terminal and display mode

(setq display-time-format "%H:%M %d %b %y" display-time-default-load-average nil) ;; Show hour minute day month and year
(setq display-time-day-and-date t display-time-24hr-format t) ;; Change format to 24h
(display-time)               ;; Show the time in the bar

(unless (equal "Battery status not available" (battery)) ;;Show battery
  (display-battery-mode 1))    ; On laptops it's nice to know how much power you have

(setq-default mode-line-format
              (append mode-line-format
                      (list
                       '(:eval (if (use-region-p)
                                   (format "W:%d, C:%d"
                                           (count-words-region (region-beginning) (region-end))
                                           (- (region-end) (region-beginning)))
                                 "")))))
(column-number-mode)                                    ;; Show collumn in modeline

(bookmark-bmenu-list)
(switch-to-buffer "*Bookmark List*")
(setq auth-sources '("~/.authinfo" "~/.authinfo.gpg" "~/.netrc" "~/.emacs.d/.authinfo")) ;; Check this later

(setq ring-bell-function 'ignore)                       ;; Remove bell ring
(if (display-graphic-p)                                 ;; Highlight lines
    (global-hl-line-mode 1)      
  (global-hl-line-mode 0))

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))     ;; one line at a time
(setq mouse-wheel-progressive-speed nil)                ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't)                      ;; scroll window under mouse
(setq scroll-step 1)                                    ;; keyboard scroll one line at a time

(show-paren-mode 1)                                     ;; Show parens
(global-visual-line-mode 1)  ;; Better than fix the lines with set-fill-column
(delete-selection-mode 1) ;; Let you select and replace with yank or write
(add-hook 'prog-mode-hook #'subword-mode) 
(add-hook 'org-mode-hook #'subword-mode)

(put 'dired-find-alternate-file 'disabled nil)

(setq package-archives                                           ;; Init package repositories.
      '(("gnu"          . "https://elpa.gnu.org/packages/")      ;; Set GNU repository
        ("melpa"        . "https://melpa.org/packages/")))       ;; Set Melpa repository
(unless package-archive-contents (package-refresh-contents))     ;; Are package archives up to date?
(unless (package-installed-p 'use-package)                       ;; Is 'use-package' installed?
  (package-install 'use-package)
  (setq use-package-always-ensure t))

;; Configuración optimizada de números de línea
(use-package emacs
  :init
  ;; ---------------------------
  ;; 1. Habilitar en modos padres (evita redundancia)
  ;; ---------------------------
  ;; text-mode-hook ya cubre org-mode, markdown-mode, etc.
  ;; prog-mode-hook cubre todos los lenguajes de programación
  (defun my/enable-line-numbers ()
    "Activar números de línea solo en GUI y modos específicos."
    (when (display-graphic-p)
    (display-line-numbers-mode 1)))

  ;; Añadir solo a los hooks principales
  (dolist (hook '(text-mode-hook prog-mode-hook conf-mode-hook))
    (add-hook hook #'my/enable-line-numbers :append))

  ;; ---------------------------
  ;; 2. Deshabilitar en modos específicos (más eficiente)
  ;; ---------------------------
  (defun my/disable-line-numbers ()
    "Desactivar números de línea donde no se necesitan."
    (display-line-numbers-mode -1))

  ;; Org Mode (sobrescribe text-mode-hook)
  (add-hook 'org-mode-hook #'my/disable-line-numbers :append))

(when (display-graphic-p)
  (use-package vscode-dark-plus-theme
    :ensure t
    :defer t
    :init
    (add-hook 'after-init-hook (load-theme 'vscode-dark-plus t))))

(setq org-startup-folded t)
(setq org-return-follows-link 1)
(setq org-src-tab-acts-natively t)    ;; Indent code in org-babel

(use-package org
  :defer t
  :config
