README.el
  (setq org-adapt-indentation t
        org-odd-levels-only nil
	org-cycle-separator-lines 0
	org-src-tab-acts-natively t	
        org-src-preserve-indentation t
        org-edit-src-content-indentation 1
	org-startup-with-inline-images nil ;; Startup with inline images (disable)
	org-image-actual-width nil)
  ;; Carga org-indent-mode solo en GUI usando eval-after-load
  (when (display-graphic-p)
    (setq org-hide-leading-stars t)
    (with-eval-after-load 'org  ; Espera a que Org esté cargado
      (add-hook 'org-mode-hook 'org-indent-mode)))
  (with-eval-after-load 'ox-latex  
    (add-to-list 'org-latex-classes
		 '("reporti"
                   "\\documentclass{reporti}
                  [NO-DEFAULT-PACKAGES]
                  [NO-PACKAGES]"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
  
;; Prefer minted for source code export in LaTeX.
(setq org-latex-listings (quote minted))

;; Prefex `xelatex' as the LaTeX processor.
(setq org-latex-compiler "xelatex")

;; Make sure that LaTeX knows about the `minted' package: we take care
;; of it in `org-latex-packages-alist' and we do *NOT* want to include
;; it explicitly as a #+LATEX_HEADER, since the options may differ, in
;; which case the two inclusions will conflict.
(setq org-latex-packages-alist '(("outputdir=./build" "minted" nil)))

;; `org-latex-pdf-process' is a list of shell commands. We take advantage of that
;; to:
;;   - create the `build' subdirectory if it is not present
;;   - run `latexmk' with the proper options (in particular `-shell-escape' which i
;;     necessary in order to allow the LaTeX processor to run an external program,
;;     like `pygmentize' in the case of `minted'; and `-output-directory' to allow
;;     all the artifacts to be sent there)
;;   - finally, move the `.pdf' file to the parent directory of the `build' subdirectory
;;     so that the exporter will be able to find it and not complain.
;; Note also that `%latex' is replaced by the value of `org-latex-compiler' so we use
;; `xelatex' as our LaTeX processor.
(setq org-latex-pdf-process '("mkdir -p build"
                              "latexmk -f -pdf -%latex -shell-escape -interaction=nonstopmode -output-directory=%o/build %f"
                              "mv %o/build/%b.pdf %O")))


;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
		prog-mode-hook
		matlab-mode-hook
		conf-mode-hook
		lisp-mode-hook))
  (add-hook mode (lambda () 
		   (display-line-numbers-mode 1))))    

;; Override modes which derive from the above
(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda () 
		   (display-line-numbers-mode -1))))
;; Fix bug open tree
(setq org-fold-core-style 'overlays)

(setq org-agenda-files '("~/Documents/org-mode-files/Agenda.org"))
(setq org-agenda-block-separator 61)
(setq org-agenda-restore-windows-after-quit t)            
(setq org-agenda-window-setup 'only-window)

(defun update-last-modified ()
  "Actualizar la clave 'last_modified' en el encabezado de Org-mode al guardar."
  (when (eq major-mode 'org-mode)
    (save-excursion
      (goto-char (point-min))
      (when (re-search-forward "^#\\+last_modified:.*" nil t)
        (replace-match (format "#+last_modified: %s" (format-time-string "%Y-%m-%d %H:%M:%S")))))))

(add-hook 'before-save-hook 'update-last-modified)

(setq org-todo-keywords
	'((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)")
	  (sequence "EXPERIMENTAL(e)" "FAIL(f)" "|" "WORKS(w)")))

(setq org-todo-keyword-faces
	'(("IN-PROGRESS" . (:weight normal :box (:line-width 1 :color (\, yellow) :style nil) :foreground "yellow"))
	  ("WAITING" . (:weight normal :box (:line-width 1 :color (\, pink) :style nil) :foreground "pink"))
	  ("EXPERIMENTAL" . (:weight normal :box (:line-width 1 :color (\, white) :style nil) :foreground "white"))
	  ("WORKS" . (:weight normal :box (:line-width 1 :color (\, green) :style nil) :foreground "green"))
	  ("FAIL" . (:weight normal :box (:line-width 1 :color (\, red) :style nil) :foreground "red"))))

(setq org-src-fontify-natively t)
(setq org-confirm-babel-evaluate nil) ;; Stop the confirmation to evaluate org babel
(use-package ob-python
  :defer t
  :commands (org-babel-execute:python))

(use-package ob-shell
  :defer t
  :commands
  (org-babel-execute:sh
   org-babel-expand-body:sh
   org-babel-execute:bash))

(use-package ob-js
  :defer t
  :commands (org-babel-execute:js))

(use-package ob-octave
  :defer t
  :commands (org-babel-execute:octave))

(use-package ob-css
  :defer t
  :commands (org-babel-execute:css))

(use-package ob-dot
  :defer t
  :commands (org-babel-execute:dot))

(use-package ob-latex
  :defer t
  :commands (org-babel-execute:latex))

(use-package ob-lua
  :defer t
  :commands (org-babel-execute:lua))

(use-package ob-C
  :defer t
  :commands
  (org-babel-execute:C
   org-babel-expand-body:C
   org-babel-execute:C++
   org-babel-expand-body:C++))

(use-package ob-matlab
  :defer t
  :commands (org-babel-execute:matlab))

(setq backup-directory-alist `(("." . "~/.emacs.d/.backups"))) ;;Backup directory
(setq read-file-name-completion-ignore-case t)        ;; Insensitive letter case
(setq large-file-warning-threshold nil)               ;; Dont warn for large files
(setq dired-dwim-target t)                             ;; Allow you move files splitting the window
(setq dired-listing-switches "-la")

(global-auto-revert-mode 1)                          ;; Revert buffers when the underlying file has changed
(setq global-auto-revert-non-file-buffers t)         ;; Revert Dired and other buffers

(setq auto-revert-remote-files nil)                    ;; Revert buffer in remote (SLOW)

(add-hook 'shell-mode-hook
          (lambda () (local-set-key (kbd "C-l") #'comint-clear-buffer)))

(setq-default tab-width 2)                           ;; Default to an indentation size of 2 spaces
(setq-default evil-shift-width tab-width)            ;; Default to an indentation size of 2 spaces
(setq-default indent-tabs-mode nil)                  ;; Use spaces instead of tabs for indentation
(setq-default buffer-file-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
