README.org
** DONE Code for compile dev_ws
#+begin_src emacs-lisp
(defun my/ros-colcon-build ()
  "build project 1"
  (interactive)
  (let ((buf-name '"*jea-compile-project1*")
        (working-dir '"~/Documents/Universidad/CyPR/ROS/dev_ws/"))
    (save-excursion
      (with-current-buffer (get-buffer-create buf-name)
        (barf-if-buffer-read-only)
        (erase-buffer))
      (cd working-dir)
      (call-process-shell-command "colcon build" nil buf-name 't)
      (cd "~/coppelia_ws/")
      (call-process-shell-command "colcon build" nil buf-name 't)
      (message "compile project 1 done")
      )))
(global-set-key [(f10)] 'my/ros-colcon-build)
#+end_src

** DONE Show size of file in dired mode
#+begin_src emacs-lisp
;; https://adamoudad.github.io/posts/emacs/remote-command-ssh/
;; https://oremacs.com/2015/01/12/dired-file-size/
(defun dired-get-size ()
  (interactive)
  (let ((files (dired-get-marked-files)))
    (with-temp-buffer
      ;; Obtener el nombre del host remoto
      (let ((remote-hostname (shell-command-to-string "hostname")))

        ;; Eliminar posibles saltos de línea al final
        (setq remote-hostname (string-trim remote-hostname))

        ;; Dependiendo del nombre de la máquina, ejecutamos diferentes comandos
        (cond
         ;; Caso 1: Si estamos en la máquina local con nombre "DESKTOP-O45GL2P"
         ((or           (string= remote-hostname "DESKTOP-AGD6PUD") 
                        (string= remote-hostname "DESKTOP-O45GL2P")) 
          (apply 'call-process "du" nil t nil "-sch" files)
          (message "Output of du: %s" (buffer-string)))

         ;; Caso 2: Si estamos en el servidor remoto "debian"
         ((string= remote-hostname "debian")
          (let ((default-directory (expand-file-name my-remote-path)))
            (let* ((cleaned-files
                    (mapcar (lambda (file)
                              (replace-regexp-in-string my-remote-path-mod "" file))
                            files))
                   (du-output (shell-command-to-string (concat "du -sch " (mapconcat 'identity cleaned-files " ")))))
              ;; Mostrar la salida en el buffer de mensajes
              (message "Output of du: %s" du-output))))

         ;; Caso 3: Si estamos en otra máquina, por ejemplo, "other-server"
         ((string= remote-hostname "other-server")
          (let ((default-directory (expand-file-name "/ssh:user@other-server:/path/to/directory")))
            (let ((du-output (shell-command-to-string "du -sch /path/to/directory")))
              ;; Mostrar la salida en el buffer de mensajes
              (message "Output of du: %s" du-output))))

         ;; Si el nombre del host no coincide con los anteriores
         (t
          (message "No se ha definido un comando para esta máquina.")))))))

(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "z") 'dired-get-size))
#+end_src

** DONE Email config
#+begin_src emacs-lisp
(setq gnus-home-directory "~/.emacs.d/")
(setq mail-signature-file "~/.emacs.d/.signature")
(add-hook 'dired-mode-hook 'turn-on-gnus-dired-mode)
#+end_src
* COMMENT Experimental
** TODO Autocomplete on replace
** EXPERIMENTAL Org-mode
#+begin_src emacs-lisp
(with-eval-after-load "org"
  (define-key org-mode-map "\C-e" nil)
  (define-key org-mode-map [remap move-end-of-line] nil))

(setq org-tidy-protect-overlay nil)
#+end_src

** EXPERIMENTAL Multiple cursors
#+begin_src emacs-lisp
(use-package multiple-cursors
  :ensure t
  :defer t)
#+end_src

** EXPERIMENTAL Org mode solution
#+begin_src emacs-lisp
(setq org-fold-core-style 'overlays)
(setq org-tag-alist
      '(;; Places
        ("@home" . ?H)
        ("@work" . ?W)

        ;; Devices
        ("@computer" . ?C)
        ("@phone" . ?P)

        ;; Activities
        ("@planning" . ?n)
        ("@programming" . ?p)
        ("@writing" . ?w)
        ("@creative" . ?c)
        ("@email" . ?e)
        ("@calls" . ?a)
        ("@errands" . ?r)))
#+end_src

** EXPERIMENTAL HTMLfontify
#+begin_src emacs-lisp
(use-package htmlize
  :ensure t)
(setq org-html-htmlize-output-type 'css)
#+end_src
** EXPERIMENTAL YASnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :config
  (yas-global-mode 1)) ; Activar Yasnippet en todo Emacs
;; (setq yas-snippet-dirs
;;       '("~/.emacs.d/snippets"          ; Snippets personalizados
;;         yasnippet-snippets-dir))       ; Snippets de yasnippet-snippets

#+end_src
** EXPERIMENTAL pdf-to-svg
#+begin_src emacs-lisp
(defun my/pdf-to-svg ()
  "Get as input a PDF file and return it as an SVG."
  (interactive)
  (shell-command (concat "inkscape " (read-file-name "File name: ") " --export-area-drawing --batch-process --export-type=svg --export-filename=" (read-from-minibuffer (concat "Name output file:")) ".svg&")))
#+end_src
** EXPERIMENTAL Writting
#+begin_src emacs-lisp
(use-package writegood-mode  
  :ensure t)  
#+end_src
* COMMENT Finish startup optimization
** Restaurar valores razonables tras el inicio
Después de cargar Emacs, el umbral de recolección de basura se ajusta a 8 MB (2^23 bytes) para un uso general. El porcentaje de memoria adicional antes de forzar la recolección se establece en 0.5.
#+begin_src emacs-lisp
(setq gc-cons-threshold (* 2 1000 1000)) ;; The default is 800 kilobytes. Measured in bytes.
(setq gc-cons-percentage 0.5)
#+end_src
** Recolección de basura periódica
Ejecuta la recolección de basura cada 60 segundos mientras Emacs está inactivo para mantener la memoria optimizada sin interferir en las operaciones del usuario.
#+begin_src emacs-lisp
(run-with-idle-timer 60 t #'garbage-collect)
#+end_src
* COMMENT Commit Template
<tipo>(<área>): <breve descripción del cambio>

[Detalles adicionales opcionales]
- Qué se cambió y por qué.
- Impacto de los cambios.
- Referencias a tareas o issues relacionados, si los hay.

feat: Nueva funcionalidad.
fix: Corrección de errores.
docs: Cambios en la documentación.
style: Cambios que no afectan el código (formato, espacios, etc.).
refactor: Reorganización de código sin cambiar su funcionalidad.
test: Añadir o modificar pruebas.
chore: Tareas menores (ej. actualización de dependencias).

* References
1. https://web.archive.org/web/20220516055538/https://blog.d46.us/advanced-emacs-startup/
